export type Building = {

  name:string;

  icon:string;

  rooms:string[];

};






export const buildings:Building[] = [



  {

    name:"Гимназия",

    icon:"school",

    rooms:[

      "Театральный зал",

      "Склад",

      "Студия звукозаписи",

      "Видеостудия",

      "Атриум",

      "Оркестровая",

      "Стадион",

      "Спортивный зал",

      "Танцевальный зал",

      "Бассейн",

      "Библиотека",

    ],

  },







  {

    name:"Прогимназия",

    icon:"building",

    rooms:[

      "ТОК",

      "Танцевальный зал",

      "Спортивный зал",

      "Атриум",

      "Склад",

    ],

  },







  {

    name:"Детский сад",

    icon:"tree",

    rooms:[

      "Театральный зал",

      "Атриум",

      "Звукорежиссерская",

      "Хоропарк",

    ],

  },



];